**Getting started with pandas**
* While pandas adopts many coding idioms from NumPy, the biggest difference is that pandas is designed for working with tabular or heterogeneous data. NumPy, by contrast, is best suited for working with homogeneously typed numerical array data.

In [2]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

##### Series 
Are a one-dimensional array-like object containing a sequence of values of the same type and an associated array of data labels called its index

In [3]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

You can get the array representation and index object of the Series via its array and index attributes, respectively:

In [4]:
obj.array

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

Often, you'll want to create a Series with an index identifying each data point with a label:

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj2
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

Compared with NumPy arrays, you can use labels in the index when selecting single values or a set of values:

In [10]:
obj2["a"]
obj2["d"] = 6
obj2[["c", "a", "d"]]

-5

Using NumPy functions or NumPy-like operations, such as filtering with a Boolean array, scalar multiplication, or applying math functions, will preserve the index-value link:

In [11]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [12]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [13]:
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [16]:
# Another way to think about a Series is as a fixed-length, ordered dictionary, 
# as it is a mapping of index values to data values.
print("b" in obj2); print("e" in obj2)

True
False

In [17]:
# Should you have data contained in a Python dictionary, you can create a Series from it by passing the dictionary:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
# A Series can be converted back to a dictionary with its to_dict() method
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [19]:
# When you're only passing a dictionary, the index in the resulting Series will respect the order of the keys 
# according to the dictionary's keys method which depends on the key's insertion order
# You can override this by passing an index with the dictionary keys 
# in the order you want them to appear in the resulting Series:
states = ["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [20]:
# To detect missing data
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [22]:
# Series also has these as instance methods
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
# A useful Series feature for many applications is that it automatically aligns by index label in arithmetic operations:
print(obj3, "\n"); print(obj4)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [27]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [28]:
# Both the Series object itself and its index have a name attribute, which integrates with other areas of pandas functionality:
obj4.name = "population"

obj4.index.name = "state"

obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [29]:
# A Series' index can be altered in place by assignment:
print(obj, "\n")
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]
obj

0    4
1    7
2   -5
3    3
dtype: int64

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

#### **DataFrame**
DataFrame can be thought of a dictionary of Series all sharing the same index
There are many ways to construct a DataFrame though one of the most common is from a dictionary of equal-length lists/Numpy arrays

In [41]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [42]:
# For larger dataframes, use the head() to select the first 5 rows
print(frame.head(), "\n"); print(frame.tail())

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [43]:
# If you specify a sequence of columns, the Dataframe columns will be arranged in that order:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [45]:
# If you pass a column that isn't contained in the dict, it will appear with missing values in the result:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [47]:
# A column in a DataFrame can be retrieved as a Series either by dictionary-like notation 
# or by using the dot attribute notation:
# Note that the returned Series have the same index as the DataFrame, and their name attribute has been appropriately set.
print(frame2["state"], "\n");
print(frame2.year)

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [50]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [49]:
# Rows can also be retrieved by position or name with the special iloc and loc attributes:
print(frame2.loc[1], "\n"); print(frame2.iloc[2])

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [51]:
# Columns can be modified by assignment
frame2["debt"] = 16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [54]:
# When you're assigning list/arrays to a column, the values length must match the length of the DataFrame
frame2["debt"] = np.arange(6.)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [55]:
# If you assign a Series, its labels will be realigned exactly to the DataFrame’s index, 
# inserting missing values in any index values not present:
val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])
frame2["debt"] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [60]:
# Assigning a column that doesn't exist will create a new column
frame2["eastern"] = frame2["state"] == "Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

In [61]:
# We can then use delete to remove this column
del frame2["eastern"]
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [63]:
# The column returned from indexing a dataframe is a view on the underlying data, not a copy
# Thus any in-place modification to a Series will be reflected in the DataFrame
# The column can be explicitly copied with the Series' copy method

# Another common form of data is a nested dictionary of dictionaries:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}

# If the nested dictionary is passed to the DataFrame, pandas will intrepret the outer dictionary keys 
# as the columns and the inner keys as the row indices
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [64]:
# You can transpose the DataFrame (swap rows n columns)
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [65]:
# The keys in the inner dictionaries are combined to form the index in the result.
# This isn't true if an explicit index is specified:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [82]:
# Dictionaries of Series are treated in much the same way:
pdata = {"Ohio": frame3["Ohio"][:-1],
         "Nevada": frame3["Nevada"][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [85]:
# If a DataFrame's index n columns have their names attribute set, these will also be displayed:
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [86]:
# Return dataframe as a two-dimensional ndarray
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [87]:
# If the DataFrame’s columns are different data types, the data type of the returned array will 
# be chosen to accommodate all of the columns:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, -1.2],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, -1.5],
       [2003, 'Nevada', 3.2, -1.7]], dtype=object)

In [88]:
# Index Objects
# pandas' index objects are reponsible for holding the axis labels (including a DataFrame's column names)
# and other metadata (like the axis name/names). Any array/other sequence of labels you use when constructing 
# a Series/Dataframe is internally converted to an index:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])
index = obj.index
index
index[1:]

Index(['b', 'c'], dtype='object')

In [90]:
# Index objects are immutable and thus can't be modified by the user
index[1] = "d"  #TypeError

In [92]:
# Immutability makes it safer to share Index objects among data structures
labels = pd.Index(np.arange(3))
print(labels)

obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

obj2.index is labels

Int64Index([0, 1, 2], dtype='int64')

True

In [96]:
# In addition to being array-like, an Index also behaves like a fixed-size set
frame3.columns

"Ohio" in frame3.columns

2003 in frame3.index

False

In [97]:
# Unlike Python sets, a pandas Index can contain duplicate labels
pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [110]:
# Essential Functionality
# An important method on pandas object is reindex which means to create a new object with the values rearranged 
# to match the new index
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
print(obj, "\n")

# Rearrange the data according to a new index - introducing missing values if any index values were not already present:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [112]:
# For ordered data like timeseries, you may want to do some interpolation/filling of values when reindexing
# The method option allows us to do this, using a method like ffill which forward fills the values:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [115]:
# With dataframe, reindex can alter the row, columns or both. 
# When passed only a sequence, it reindexes the rows in the result:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])

frame

frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [116]:
# The columns can be reindexed with the columns keyword:
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)  # Because Ohio was not in states, the data for that column is dropped from the result

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [117]:
# Another way to reindex a particular axis is to pass the new axis label as a positional argument
# and then specify the axis to reindex with the axis keyword
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [118]:
# You can also reindex using loc n iloc and many prefer to always do it this way. 
# This works only if all of the new index labels already exist in the DataFrame 
# (whereas reindex will insert missing data for new labels):
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

#### Dropping Entries from an axis
The drop method will return a new object with the indicated value or values deleted from an axis

In [120]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [121]:
new_obj = obj.drop("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [122]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

With dataframe, index values can be dropped from either axis

In [124]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [125]:
# Calling drop with a sequence of labels will drop values from the row labels
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [126]:
# use columns keyword to drop values from the columns instead
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [131]:
# You can also drop values by using the axis keyword
data.drop("two", axis=1)

          four  one  three
Ohio      True    0      2
Colorado  True    4      6
Utah      True    8     10
New York  True   12     14

In [132]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

#### Indexing, Selection & Filtering

In [135]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [138]:
print(obj["b"])
print(obj[1])
print(obj[2:4], "\n")
print(obj[["b", "a", "d"]], "\n")
print(obj[[1, 3]], "\n")
print(obj[obj < 2], "\n")

1.0
1.0
c    2.0
d    3.0
dtype: float64

b    1.0
a    0.0
d    3.0
dtype: float64

b    1.0
d    3.0
dtype: float64

a    0.0
b    1.0
dtype: float64

In [139]:
# While you can select data with [], the preferred way to select index values is with the special loc operator:
obj.loc[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [141]:
# The reason to prefer loc is because of the different treatment of integers when indexing with []. 
# Regular []-based indexing will treat integers as labels if the index contains integers, so the behavior 
# differs depending on the data type of the index. 
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])
print(obj1, "\n"); print(obj2)

2    1
0    2
1    3
dtype: int64

a    1
b    2
c    3
dtype: int64

In [142]:
obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [143]:
obj2[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [145]:
# When using loc, the expression obj.loc[[0, 1, 2]] will fail when the index does not contain integers:
# the loc operator indexes exclusively with labels
obj2.loc[[0, 1, 2]]

KeyError: "None of [Int64Index([0, 1, 2], dtype='int64')] are in the [index]"

In [146]:
# the iloc operator indexes exclusively with integers to work consistently whether or not the index contains integers:
obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [147]:
obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [148]:
# Caution: You can also slice with labels, but it works 
# differently from normal Python slicing in that the endpoint is inclusive:
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [150]:
# Assigning values using these methods modifies the corresponding section of the Series:
obj2.loc["b":"c"] = 5
obj2

a    1
b    5
c    5
dtype: int64

In [154]:
# Indexing into a DataFrame retrieves one or more columns either with a single value or sequence:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])

print(data, "\n")

print(data["two"], "\n")

print(data[["three", "one"]])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [155]:
# Indexing like this has a few special cases. The first is slicing or selecting data with a Boolean array:

data[:2] # this is a row selection syntax

data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [156]:
# Another use case is indexing with a Boolean DataFrame, such as one produced by a scalar comparison.
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [ ]:
# We can use this dataframe to assign the value 0 to each location with the value True like so:
data[data < 5] = 0

In [157]:
# Selection on DataFrame with loc and iloc
# DataFrame has special attributes loc and iloc for label-based and integer-based indexing, respectively.
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [162]:
# Let's select a single row by label:
data.loc["Colorado"]

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [167]:
# The result of selecting a single row is a Series with an index that contains the DataFrame's column labels. 
# To select multiple rows, creating a new DataFrame, pass a sequence of labels:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [168]:
# You can combine both row and column selection
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [172]:
# We'll then perform some similar selections with integer using iloc:
data.iloc[2]
data.iloc[[2, 1]]
data.iloc[2, [3, 0, 1]]
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [178]:
# Both indexing functions work with slices in addition to single labels or lists of labels:
#data
data.loc[:"Utah", "two"]

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [174]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [179]:
# Boolean arrays can be used with loc but not with iloc
data.loc[data.three >= 2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [181]:
data.loc["Ohio", "four"]

3

#### Integer indexing pitfalls
Working with pandas objects indexed by integers can be a stumbling block for new users since they work differently from built-in Python data structures like lists and tuples.

In [184]:
ser = pd.Series(np.arange(3.))
ser
ser[-1]

KeyError: -1

In [186]:
# In this case, pandas could "fall back" on integer indexing. Here we have an index containing 
# 0, 1, and 2, but pandas does not want to guess what the user wants (label-based indexing or position-based):

# On the other hand, with a noninteger index, there is no such ambiguity:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])
ser2[-1]

2.0

In [187]:
# If you have an axis index containing integers, data selection will always be label-oriented
# However if you use loc/iloc, you'll always get what you want:
ser.iloc[-1]

2.0

In [188]:
# On the other hand, slicing with integers is always integer-oriented
ser[:2]
# As a result of these pitfalls, it is always prefered to index with loc&iloc in order to avoid ambiguity

0    0.0
1    1.0
dtype: float64

#### Pitfalls with chained indexing
loc & iloc can also be used to modify dataframe objects in place but doing so requires some care

In [190]:
data.loc[:, "one"] = 1
data

          one  two  three  four
Ohio        1    1      2     3
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [192]:
data.iloc[2] = 5
data

          one  two  three  four
Ohio        1    1      2     3
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [193]:
data.loc[data["four"] > 5] = 3
data

          one  two  three  four
Ohio        1    1      2     3
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [195]:
# A common gotcha for new pandas users is to chain selections when assigning like this:
data.loc[data.three == 5]["three"] = 6

# this warning warns you that you are trying to modify a temporary value (the nonempty result of data.loc[data.three == 5]) 
# instead of the original DataFrame data, which might be what you were intending. 

# The fix is to rewrite the chained assignment to use a single loc operation:
data.loc[data.three == 5, "three"] = 6

c:\python37\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

#### ARITHMETIC & DATA ALIGNMENT

In [196]:
# pandas can make it much simpler to work with objects that have different indexes
# For example, when you add objects, if any index pairs are not the same, the respective index 
# in the result will be the union of the index pairs. 
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=["a", "c", "e", "f", "g"])

In [197]:
# The internal data alignment introduces missing values in the label locations that don’t overlap.
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [199]:
# In the case of DataFrame, alignment is performed on both rows and columns:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
                   index=["Ohio", "Texas", "Colorado"])

df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])

print(df1, "\n")
print(df2)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [200]:
# Adding these returns a DataFrame with index and columns that are the unions of the ones in each DataFrame:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [202]:
# If you add DataFrame objects with no column or row labels in common, the result will contain all nulls:
df1 = pd.DataFrame({"A": [1, 2]})
df2 = pd.DataFrame({"B": [3, 4]})
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

#### Arithmetic methods with fill values
In arithmetic operations between differently indexed objects, you might want to fill with a special value, like 0, when an axis label is found in one object but not the other. Here is an example where we set a particular value to NA:

In [203]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list("abcde"))

print(df1, "\n")
print(df2)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [204]:
# Adding these results in missing values in areas that don't overlap
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [205]:
# Using the add method with fill_value to nan
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [207]:
# Reversed division

# These 2 operations do the same thing:
print(1/df1, "\n")

df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [211]:
# Relatedly when reindexing a Series/DataFrame, you can also specify a different value:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [213]:
# Operations btw DataFrame & Series
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [214]:
arr[0]

array([0., 1., 2., 3.])

In [215]:
# Consider the difference btw a 2D array and one of its rows
# The substraction is performed once for each row - this is referred to as broadcasting
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [218]:
# Operations btw a DataFrame and a Series are similar:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

# Get elements of the first row
series = frame.iloc[0]

# By default, arithmetic btw DataFrame and a Series matches the index of the Series on the columns of the dataframe
# broadcasting down the rows:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [219]:
# If an index value is not found in either the DataFrame’s columns or 
# the Series’s index, the objects will be reindexed to form the union:

series2 = pd.Series(np.arange(3), index=["b", "e", "f"])
series2

b    0
e    1
f    2
dtype: int32

In [220]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [222]:
# If you want to broadcast over the columns, matching on the rows, you have to use one of the arithmetic methods
# and specify to match over the index:
series3 = frame["d"]

print(series3, "\n")
print(frame)

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [223]:
frame.sub(series3, axis="index") # the axis passed is the axis to match on-here we match on row index n broadcast over columns

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

#### Function Application & Mapping

In [227]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

frame
np.abs(frame)

               b         d         e
Utah    2.282031  0.762418  1.134913
Ohio    0.808119  1.967479  1.222835
Texas   0.597151  1.951685  0.423903
Oregon  0.881518  0.873838  0.577254

In [231]:
# Another frequent operation is applying a function on 1D arrays to each column/row. Dataframe apply method does exactly this
def f1(x):
    return x.max() - x.min()
frame.apply(f1)

b    1.684880
d    3.919163
e    2.357748
dtype: float64

In [232]:
# Using axis=columns, the func will be invoked once per row instead
# A helpful way to think about this is "apply across the columns"
frame.apply(f1, axis="columns")

Utah      3.416944
Ohio      3.190314
Texas     1.527782
Oregon    1.458772
dtype: float64

In [233]:
# Many of the most common array statistics (like sum & mean) are DataFrame methods 
# so usin apply is not necessary

# The function passed to apply need not return a scalar value; it can also return a Series with multiple values:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])
frame.apply(f2)

            b         d         e
min  0.597151 -1.967479 -1.134913
max  2.282031  1.951685  1.222835

In [234]:
# Element wise Python functions can be used too. Suppose you wanted to compute a formatted string from each floating point value
# in frame. You can do this with applymap:
def my_format(x):
    return f"{x:.2f}"
frame.applymap(my_format)

           b      d      e
Utah    2.28  -0.76  -1.13
Ohio    0.81  -1.97   1.22
Texas   0.60   1.95   0.42
Oregon  0.88   0.87  -0.58

In [235]:
# The reason for applymap is that Series has a map method for applying an element-wise function:
frame["e"].map(my_format)

Utah      -1.13
Ohio       1.22
Texas      0.42
Oregon    -0.58
Name: e, dtype: object

#### Sorting & Ranking
To sort lexicographically by row or column label, use the sort_index method, which returns a new, sorted object:

In [237]:
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [240]:
# With a DataFrame, you can sort by index on either axis
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])

frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [241]:
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [242]:
# The data is sorted in ascending order by default but can also be sorted in descending order
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [243]:
# To sort a series by its values:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [245]:
# Any missing values are sorted to the end of the series by default
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [246]:
# Missing values can be sorted to the start instead by using the na_position option:
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [253]:
# When sorting a DataFrame, you can use the data in one/more columns as the sort keys. 
# To do so, pass one or more column names to sort_values
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame
frame.sort_values("b")
frame.sort_values("a")

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

In [254]:
# Ranking assign ranks from one through the number of valid data points in an array starting from the lowest value
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank() # rank break ties by assigning each group the mean rank

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [260]:
# Ranks can also be assigned according to the order in which they're observed in the data
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [256]:
# You can rank in descending order too:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [257]:
# DataFrame can compute ranks over the rows/columns:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                       "c": [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [258]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

#### Axis indexes with duplicate labels
Up until now almost all of the examples we have looked at have unique axis labels (index values).
While many pandas functions (like reindex) require that the labels be unique, it’s not mandatory. 
Let’s consider a small Series with duplicate indices:

In [261]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [266]:
obj.index.is_unique  # the is_unique property can tell us whether the indices are unique

False

In [267]:
# Indexing a label with multiple entries returns a Series, while single entries return a scalar value:
obj["a"]

a    0
a    1
dtype: int32

In [268]:
obj["c"]

4

In [270]:
# This can make your code more complicated, as the output type from indexing can vary based on whether/not a label is repeated:
# The same logic extends to indexing rows(or columns) in a Dataframe:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])

df

          0         1         2
a  0.514984  0.261910  0.461300
a  0.769754  1.452788 -0.929345
b  1.685996  0.039773  1.604735
b -0.289942 -0.622929  0.846740
c -0.659572  1.060172 -0.359892

In [271]:
df.loc["b"]

          0         1         2
b  1.685996  0.039773  1.604735
b -0.289942 -0.622929  0.846740

In [272]:
df.loc["c"]

0   -0.659572
1    1.060172
2   -0.359892
Name: c, dtype: float64

#### Summarizing & Computing Descriptive Statistics

In [275]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [276]:
# Calling DataFrame's sum method returns a Series containing column sums:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [277]:
# Sum across the columns instead:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [278]:
# When an entire row or column contains all NA values, the sum is 0, whereas if any value is not NA, 
# then the result is NA. This can be disabled with the skipna option, in which case any NA value in a 
# row or column names the corresponding result NA:
df.sum(axis="index", skipna=False)

one   NaN
two   NaN
dtype: float64

In [279]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [280]:
# Some aggregations like mean requires at least one non-NA value to yield a value result. So here we have:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

Some methods like idxmin() and idxmax() return indirect statistics like the index value where the minimum/maximum values 
are attained:

In [295]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [292]:
df.idxmax()   # returns the index for the maximum value in each column

one    b
two    d
dtype: object

In [294]:
# Other methods are accumulations:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [296]:
# describe to produce multiple summary statistics in one shot:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [299]:
# On nonnumeric data, describe produces alternative summary statistics:
obj = pd.Series(["a", "a", "b", "c"] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

#### Correlation & Covariance

In [301]:
price = pd.read_pickle("examples/yahoo_price.pkl")
volume = pd.read_pickle("examples/yahoo_volume.pkl")

In [307]:
price.head()
volume.head()

                 AAPL      GOOG      IBM      MSFT
Date
2010-01-04  123432400   3927000  6155300  38409100
2010-01-05  150476200   6031900  6841400  49749600
2010-01-06  138040000   7987100  5605300  58182400
2010-01-07  119282800  12876600  5840600  50559700
2010-01-08  111902700   9483900  4197200  51197400

In [305]:
# Let's compute percent change of prices
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [309]:
# The corr method of Series computes the correlation of the overlapping, non-NA, aligned-by-index values in 2 series
# Relatedly, cov computes the covariance
returns["MSFT"].corr(returns["IBM"])
returns["MSFT"].cov(returns["IBM"])

8.870655479703546e-05

In [310]:
# DataFrame's corr and cov methods returns a full correlation/covariance matrix as a dataframe
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [311]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [312]:
# Using DataFrame's corrwith, you can compute pair-wise correlations btw a DataFrame's columns/rows with another 
# Series or DataFrame. Passing a Series returns a Series with the correlation value computed for each column
returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [318]:
# Passing a DataFrame computes the correlations of matching column names. 
# Here, I compute correlations of percent changes with volume:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

#### Unique Values, Value Counts & Membership

In [339]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])
uniques = obj.unique()

# Unique values are returned unsorted - but maybe sorted after the fact
uniques.sort()

In [340]:
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [336]:
# Compute value frequencies
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [341]:
# value_counts is also available as a top-level pandas method that can be used with NumPy arrays or other Python sequences:
pd.value_counts(obj.to_numpy(), sort=False)

b    2
d    1
c    3
a    3
dtype: int64

In [342]:
# isin performs a vectorized set membership check and can be useful in filtering a dataset 
# down to a subset of values in a Series or column in a DataFrame:
mask = obj.isin(["b", "c"])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [343]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object